#+TITLE: «Грамотный DevOps»: пишем конфигурацию с помощью Emacs, Org и Jinja
#+SETUPFILE: ~/.emacs.d/org-themes/src/comfy_inline/comfy_inline.theme
#+PROPERTY: header-args  :comments no

* Отправляем тестовые письма

Для тестирования отправки писем хорошо подходит [[https://github.com/jetmore/swaks][Swaks]].

Первое  поле в  файле =passwd.smarthosts=  у нас  соответствует адресу
электронной почты, с которого нужно отправить письмо. Приведенный ниже
скрипт  извлекает первое  поле из  всех строк  этого файла,  пропуская
комментарии,   начинающиеся   с   #,   и  записывает   их   в   массив
=emails=. Команда =mapfile= специфична для =bash=.

В заголовке имеются  переменные =MAILTO= --- это адрес,  на который мы
отправляем  тестовые   письма,  и   =PASSWORD=  ---  это   пароль  для
аутентификации  на  нашем  сервере   Exim  (хэши  паролей  хранятся  в
=/etc/exim/passwd=).  Он у  нас  один на  всех.  Переделка скрипта  на
использование  разных  паролей  оставлена в  качестве  упражнения  для
читателя.

#+begin_example
#+BEGIN_SRC bash :var MAILTO="email@example.org" PASSWORD="hunter2" :results value
  mapfile -t <<<$(grep -v '#' ./secrets/passwd.smarthosts \
		      | cut -f 1 -d :) emails

  for i in "${emails[@]}"
  do
      swaks -tls -a \
	    --to $MAILTO \
	    --from $i \
	    --server localhost \
	    --auth-user $i \
	    --auth-password $PASSWORD
  done
#+END_SRC
#+end_example

#+BEGIN_SRC bash :var MAILTO="email@example.org" PASSWORD="hunter2" :results value :exports none
  mapfile -t <<<$(grep -v '#' ./secrets/passwd.smarthosts \
		      | cut -f 1 -d :) emails

  for i in "${emails[@]}"
  do
      swaks -tls -a \
	    --to $MAILTO \
	    --from $i \
	    --server localhost \
	    --auth-user $i \
	    --auth-password $PASSWORD
  done
#+END_SRC

#+RESULTS: emails
: 0

